# !/usr/bin/python
# -*- coding: UTF-8 -*-
#主页面
from Log import Log
from Muma import Muma
from SecurityConf import SecurityConf
from Command import Command

class Index():
    def __init__(self):
        while True:
            print('*' * 17,'**************************************@welcome to HIDS@********************************','*'  * 17)
            print('*' * 17, '***************conf.xml可以增加修改日志路径，监控目录路径，执行命令内容****************', '*' * 17)
            print('*' * 17, '*********conf.xml可以修改php.ini、my.cnf的路径，检测内容在/conf/security中设置*********', '*' * 17)
            print('*' * 17, '*************ruleset中的decoder.xml和rules.xml可以添加或修改解码器和规则***************', '*' * 17)
            print('*' * 17, '本人水平有限，此工具为简单的HIDS工具，模仿Wazuh,功能还不够完善，如有Bug和错误，还望见谅', '*' * 17)
            print('*' * 17, '*监控日志(1)***************************************************************监控木马(2)*','*' * 17)
            print('*' * 17, '*输出命令(3)*********************************************************审计安全配置项(4)*','*' * 17)
            print('*' * 17, '**************************************退出(9)******************************************', '*' * 17)
            i=int(input('请输入你想执行操作对应的数字:'))
            if i==1:
                # print('*' * 17,"正在实时监测日志",'*' * 17)
                log=Log()
            elif i==2:
                muma=Muma()
            elif i==3:
                command=Command()   
                log2=Log()
            elif i==4:
                security=SecurityConf()
            elif i==9:
                print('*' * 17, '************************************退出***成功****************************************','*' * 17)
                print('*' * 17, '**********************************欢迎*再次*光临***************************************', '*' * 17)
                break
index=Index() 
    



